tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"

brew "git"
brew "gh"
brew "eza"
brew "bat"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "jq"
brew "yq"
brew "wget"
brew "curl"
brew "tmux"
brew "htop"
brew "watchman"
brew "imagemagick"
brew "nvm"
brew "node"
brew "pnpm"
brew "yarn"
brew "bun"
brew "python"
brew "ruby"
brew "rust"
brew "deno"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

cask "iterm2"
cask "raycast"
cask "visual-studio-code"
cask "warp"
cask "tableplus"
cask "postman"
cask "docker"

